# FilePath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableErrorInfo..::..FilePath Property
FamilySizeTableErrorInfo Class See Also
---
The path of the imported CSV file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string FilePath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FilePath As String
	Get
```

Visual C++
---
```text
public:
property String^ FilePath {
	String^ get ();
}
```

# See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace